#Дана сторона куба.Найти объем куба и площадь стороны
a = int(input('Введите сторону'))
a **= 2 #площадь
print(a)
a *= a #объем
print(a)